AccumulationRegisters/ДенежныеСредстваВКассахККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВКассахККМ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКПоступлениюВКассуККМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКПоступлениюВКассуОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредстваВКассахККМ/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства)
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ВалютаУпр", Константы.ВалютаУправленческогоУчета.Получить());
	ДополнительныеСвойства.Вставить("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	
	// Текущее состояние набора помещается во временную таблицу,
	// чтобы при записи получить изменение нового набора относительно текущего.
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Записи.Период                        КАК Период,
	|	Записи.Регистратор                   КАК Регистратор,
	|	Записи.Организация                   КАК Организация,
	|	Записи.КассаККМ                      КАК Касса,
	|
	|	Записи.Сумма                         КАК Сумма,
	|	Записи.СуммаУпр                      КАК СуммаУпр,
	|	Записи.СуммаРегл                     КАК СуммаРегл
	|
	|ПОМЕСТИТЬ ДенежныеСредстваВКассахККМПередЗаписью
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ КАК Записи
	|ГДЕ
	|	Записи.Регистратор = &Регистратор
	|	И (ТипЗначения(Записи.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|		ИЛИ Записи.КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпр
	|		ИЛИ Записи.КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегл
	|	)
	|");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ВалютаУпр",   ДополнительныеСвойства.ВалютаУпр);
	Запрос.УстановитьПараметр("ВалютаРегл",  ДополнительныеСвойства.ВалютаРегл);
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Или Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства)
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Таблица.Период                       КАК Период,
	|	Таблица.Регистратор                  КАК Регистратор,
	|	Таблица.Организация                  КАК Организация,
	|	Таблица.Касса                        КАК Касса,
	|	СУММА(Таблица.Сумма)                 КАК СуммаИзменение,
	|	СУММА(Таблица.СуммаУпр)              КАК СуммаУпрИзменение,
	|	СУММА(Таблица.СуммаРегл)             КАК СуммаРеглИзменение
	|ПОМЕСТИТЬ ТаблицаИзмененийДенежныеСредстваВКассахККМ
	|ИЗ
	|	(ВЫБРАТЬ
	|		Записи.Период                        КАК Период,
	|		Записи.Регистратор                   КАК Регистратор,
	|		Записи.Организация                   КАК Организация,
	|		Записи.Касса                         КАК Касса,
	|
	|		Записи.Сумма                         КАК Сумма,
	|		Записи.СуммаУпр                      КАК СуммаУпр,
	|		Записи.СуммаРегл                     КАК СуммаРегл
	|	ИЗ
	|		ДенежныеСредстваВКассахККМПередЗаписью КАК Записи
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Записи.Период                         КАК Период,
	|		Записи.Регистратор                    КАК Регистратор,
	|		Записи.Организация                    КАК Организация,
	|		Записи.КассаККМ                       КАК Касса,
	|
	|		-Записи.Сумма                         КАК Сумма,
	|		-Записи.СуммаУпр                      КАК СуммаУпр,
	|		-Записи.СуммаРегл                     КАК СуммаРегл
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВКассахККМ КАК Записи
	|	ГДЕ
	|		Записи.Регистратор = &Регистратор
	|		И (ТипЗначения(Записи.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|			ИЛИ Записи.КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпр
	|			ИЛИ Записи.КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегл)
	|	) КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Период,
	|	Таблица.Регистратор,
	|	Таблица.Организация,
	|	Таблица.Касса
	|ИМЕЮЩИЕ
	|	СУММА(Таблица.Сумма) <> 0
	|	ИЛИ СУММА(Таблица.СуммаУпр) <> 0
	|	ИЛИ СУММА(Таблица.СуммаРегл) <> 0
	|");
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ВалютаУпр", ДополнительныеСвойства.ВалютаУпр);
	Запрос.УстановитьПараметр("ВалютаРегл", ДополнительныеСвойства.ВалютаРегл);
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
